{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "13e96c4c-04e6-46b4-b1d0-3f63ce9503e2",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from graphdatascience import GraphDataScience\n",
    "import pandas as pd\n",
    "from sqlalchemy import create_engine"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "191fabdc-30de-4ce5-a063-c132468e07d7",
   "metadata": {},
   "source": [
    "## connection setup\n",
    "\n",
    "#### neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "2c6e4b48-9354-430e-8bb4-d919f37200ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = \"neo4j://localhost:7687\"\n",
    "driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"Ruifan0511\"))\n",
    "gds = GraphDataScience(uri, auth=(\"neo4j\", \"Ruifan0511\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f981d5fa-d6ba-41ea-97a2-c3dc736459b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "def show_result(query):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        return pd.DataFrame(result.data())\n",
    "    #print(result.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "2a3e72fd-08c5-43e9-a2a8-b7b53d66d017",
   "metadata": {},
   "outputs": [],
   "source": [
    "def delete_graph_if_exists(graph_name):\n",
    "    with driver.session() as session:\n",
    "        try:\n",
    "            existing_graph = gds.graph.get(graph_name)\n",
    "            if existing_graph is not None:\n",
    "                gds.graph.drop(graph_name)\n",
    "                #print(f\"Graph '{graph_name}' dropped.\")\n",
    "        except Exception as e:\n",
    "            print(f\"Graph '{graph_name}' does not exist or could not be retrieved. Nothing to delete.\")"
   ]
  },
  {
   "cell_type": "raw",
   "id": "74780816-370f-482e-8933-f0e457d6be6d",
   "metadata": {},
   "source": [
    "## create citation graph\n",
    "\n",
    "with driver.session() as session:\n",
    "    query = \"\"\"\n",
    "    CALL gds.graph.project(\n",
    "      'citation_graph',  // Name of the projected graph\n",
    "      'Paper',  // Node label to include\n",
    "      {\n",
    "        CITED: {   // Relationship type to include\n",
    "          orientation: 'NATURAL'\n",
    "        }\n",
    "      }\n",
    "    );\n",
    "    \"\"\"\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "826e1600-6f29-4899-964e-84f345bbc88e",
   "metadata": {},
   "source": [
    "#### postgreSQL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "771300a7-dbf3-4496-943a-3f406432bbe0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "connected\n"
     ]
    }
   ],
   "source": [
    "db_user = \"postgres\"\n",
    "db_password = \"mf9500\"\n",
    "db_host = \"localhost\"  \n",
    "db_port = \"5432\"  \n",
    "db_name = \"research_papers\"\n",
    "\n",
    "engine = create_engine(f\"postgresql://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}\")\n",
    "\n",
    "with engine.connect() as connection:\n",
    "    print(\"connected\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fda39bcd-2382-4e15-881b-34659104a678",
   "metadata": {},
   "source": [
    "### most influential paper per topic per year\n",
    "- use `PageRank` to quanify a paper's relevence per topic per year\n",
    "- basically finds the paper that has become the most 'popular' amongst papers that were published in the same year about the same category\n",
    "\n",
    "Most Influential Paper by Topic and Year\n",
    "This query uses PageRank to measure a paper’s relevance and influence within its topic for a given year. By analyzing citation patterns, it identifies the paper that has gained the most recognition and impact among others published in the same year within the same category.\n",
    "\n",
    "Why is this insightful?\n",
    "Academic influence is often context-dependent—a paper’s impact is most meaningful when compared to its peers in the same field and time period. This query helps highlight research that has significantly shaped discussions within its specific academic community, rather than just globally."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d2ba4dc9-1d9d-48bd-b18c-f3f765bc8365",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>topic</th>\n",
       "      <th>year</th>\n",
       "      <th>paper_ids</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>2010</td>\n",
       "      <td>[4af00d38-e8a2-4f4c-a819-816772c52e0f, 4c03835...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0</td>\n",
       "      <td>2011</td>\n",
       "      <td>[4abddc96-3f8c-4f2b-a83b-4c1a6fa1e3d5, 4ae0227...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0</td>\n",
       "      <td>2012</td>\n",
       "      <td>[4ad24813-c42d-4807-8bae-f8aca28d259c, 4b3ae4c...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0</td>\n",
       "      <td>2013</td>\n",
       "      <td>[4b8f6032-3d31-421f-a46d-63a339f80012, 4bb890f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0</td>\n",
       "      <td>2014</td>\n",
       "      <td>[4acb3623-e94f-404d-a122-bc92f3ee654f, 4ae0c0c...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>14</td>\n",
       "      <td>2013</td>\n",
       "      <td>[4b71d6bf-5ffb-49d8-a621-c70ed5cf0fbd, 4b76062...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>116</th>\n",
       "      <td>14</td>\n",
       "      <td>2014</td>\n",
       "      <td>[4ae093d8-9359-4783-86a6-c279afe38a21, 4af911e...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>117</th>\n",
       "      <td>14</td>\n",
       "      <td>2015</td>\n",
       "      <td>[4b3b22c6-c3a2-455d-b189-bb8bf280dfe0, 4b8b0ad...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>118</th>\n",
       "      <td>14</td>\n",
       "      <td>2016</td>\n",
       "      <td>[4acd8824-2bdc-4c08-b4a6-cb5cefbd0379, 4c16d3c...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>119</th>\n",
       "      <td>14</td>\n",
       "      <td>2017</td>\n",
       "      <td>[58242b32-c0d9-422a-9b0f-b57182abc6fc, d504c80...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>120 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     topic  year                                          paper_ids\n",
       "0        0  2010  [4af00d38-e8a2-4f4c-a819-816772c52e0f, 4c03835...\n",
       "1        0  2011  [4abddc96-3f8c-4f2b-a83b-4c1a6fa1e3d5, 4ae0227...\n",
       "2        0  2012  [4ad24813-c42d-4807-8bae-f8aca28d259c, 4b3ae4c...\n",
       "3        0  2013  [4b8f6032-3d31-421f-a46d-63a339f80012, 4bb890f...\n",
       "4        0  2014  [4acb3623-e94f-404d-a122-bc92f3ee654f, 4ae0c0c...\n",
       "..     ...   ...                                                ...\n",
       "115     14  2013  [4b71d6bf-5ffb-49d8-a621-c70ed5cf0fbd, 4b76062...\n",
       "116     14  2014  [4ae093d8-9359-4783-86a6-c279afe38a21, 4af911e...\n",
       "117     14  2015  [4b3b22c6-c3a2-455d-b189-bb8bf280dfe0, 4b8b0ad...\n",
       "118     14  2016  [4acd8824-2bdc-4c08-b4a6-cb5cefbd0379, 4c16d3c...\n",
       "119     14  2017  [58242b32-c0d9-422a-9b0f-b57182abc6fc, d504c80...\n",
       "\n",
       "[120 rows x 3 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "    SELECT topic, year, array_agg(id) as paper_ids \n",
    "    FROM papers \n",
    "    GROUP BY topic, year\n",
    "    ORDER BY topic, year;\n",
    "\"\"\"\n",
    "\n",
    "df = pd.read_sql(query, engine)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "1109c397-e4f9-4bb6-804f-26ed5f19e751",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>topic</th>\n",
       "      <th>year</th>\n",
       "      <th>paper_id</th>\n",
       "      <th>influence_score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>2010</td>\n",
       "      <td>9fba111f-d65a-4c21-b02e-a8d4fbbdf92c</td>\n",
       "      <td>5.084531</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0</td>\n",
       "      <td>2011</td>\n",
       "      <td>cac8070b-570d-4674-b334-dd96bbc223c6</td>\n",
       "      <td>3.400359</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0</td>\n",
       "      <td>2012</td>\n",
       "      <td>7a18d786-740c-4001-b1db-95f7d7b0ae1a</td>\n",
       "      <td>2.811377</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0</td>\n",
       "      <td>2013</td>\n",
       "      <td>f9b3409e-ab94-47f4-b926-6702900141e2</td>\n",
       "      <td>2.265877</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0</td>\n",
       "      <td>2014</td>\n",
       "      <td>f121ff70-19ef-47d8-bc6a-61a7aa201caa</td>\n",
       "      <td>2.261410</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>14</td>\n",
       "      <td>2013</td>\n",
       "      <td>62c6a9f6-ee1b-4f7f-962c-ea3eb72c0e25</td>\n",
       "      <td>4.458310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>116</th>\n",
       "      <td>14</td>\n",
       "      <td>2014</td>\n",
       "      <td>d0c7476b-4267-47ee-8062-4c1437929859</td>\n",
       "      <td>1.644981</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>117</th>\n",
       "      <td>14</td>\n",
       "      <td>2015</td>\n",
       "      <td>6c6a4710-68a7-4e05-adfb-4bf355c4381d</td>\n",
       "      <td>0.998560</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>118</th>\n",
       "      <td>14</td>\n",
       "      <td>2016</td>\n",
       "      <td>7f823c31-322c-4525-ba10-7180ae8d7666</td>\n",
       "      <td>0.961240</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>119</th>\n",
       "      <td>14</td>\n",
       "      <td>2017</td>\n",
       "      <td>85e195b1-4a31-461c-bdf1-555cf6d4557e</td>\n",
       "      <td>0.931513</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>120 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     topic  year                              paper_id  influence_score\n",
       "0        0  2010  9fba111f-d65a-4c21-b02e-a8d4fbbdf92c         5.084531\n",
       "1        0  2011  cac8070b-570d-4674-b334-dd96bbc223c6         3.400359\n",
       "2        0  2012  7a18d786-740c-4001-b1db-95f7d7b0ae1a         2.811377\n",
       "3        0  2013  f9b3409e-ab94-47f4-b926-6702900141e2         2.265877\n",
       "4        0  2014  f121ff70-19ef-47d8-bc6a-61a7aa201caa         2.261410\n",
       "..     ...   ...                                   ...              ...\n",
       "115     14  2013  62c6a9f6-ee1b-4f7f-962c-ea3eb72c0e25         4.458310\n",
       "116     14  2014  d0c7476b-4267-47ee-8062-4c1437929859         1.644981\n",
       "117     14  2015  6c6a4710-68a7-4e05-adfb-4bf355c4381d         0.998560\n",
       "118     14  2016  7f823c31-322c-4525-ba10-7180ae8d7666         0.961240\n",
       "119     14  2017  85e195b1-4a31-461c-bdf1-555cf6d4557e         0.931513\n",
       "\n",
       "[120 rows x 4 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = []\n",
    "    \n",
    "with driver.session() as session:\n",
    "    for index, row in df.iterrows():\n",
    "        topic = row[\"topic\"]\n",
    "        year = row['year']\n",
    "        paper_ids = row[\"paper_ids\"] \n",
    "        \n",
    "        # Cypher-friendly list format\n",
    "        paper_ids_str = \"[\" + \", \".join(f'\"{p}\"' for p in paper_ids) + \"]\"\n",
    "\n",
    "        query = f\"\"\"\n",
    "        CALL gds.pageRank.stream('citation_graph')\n",
    "        YIELD nodeId, score\n",
    "        WHERE gds.util.asNode(nodeId).id IN {paper_ids_str}\n",
    "        RETURN gds.util.asNode(nodeId).id AS paper_id, score AS influence_score\n",
    "        ORDER BY influence_score DESC\n",
    "        LIMIT 1;\n",
    "        \"\"\"\n",
    "\n",
    "        result = session.run(query)\n",
    "        top_paper = result.single()\n",
    "        \n",
    "        if top_paper:\n",
    "            results.append({\n",
    "                \"topic\": topic,\n",
    "                \"year\": year,\n",
    "                \"paper_id\": top_paper[\"paper_id\"],\n",
    "                \"influence_score\": top_paper[\"influence_score\"]\n",
    "            })\n",
    "\n",
    "pd.DataFrame(results)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "db0fcb6d-d657-43da-abba-9001943dbee1",
   "metadata": {},
   "source": [
    "### self-citation rate per topic\n",
    "- self-citation rate is calculated as the average \\# of times an author cites their own work.\n",
    "- the self-citation rate is calculated for each topic group\n",
    "- this gives us insight on which topic is under-researched. we infer that an under-researched field typically has a higher self-citation rate since there are fewer prior works to reference, resulting in a few authors building upon their own previous research instead of integrating other peoples' works.\n",
    "- *note:* for simplicity, each author is assigned one main topic/field they belong to."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "616a2902-6c62-4688-9dc7-d18480c51258",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    query = \"\"\"\n",
    "    MATCH (a:Author)-[:AUTHORED]->(p:Paper)-[:CITED]->(p1:Paper)<-[:AUTHORED]-(a)  \n",
    "    WITH a, COUNT(p1) AS self_citations\n",
    "    RETURN a.name AS author_name, self_citations\n",
    "    ORDER BY self_citations DESC\n",
    "    \"\"\"\n",
    "    result = session.run(query).data()\n",
    "self_citators = pd.DataFrame(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "2da253c1-3819-4eb4-aacc-b83362d8cd53",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author_name</th>\n",
       "      <th>self_citations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Loet Leydesdorff</td>\n",
       "      <td>64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Rui Zhang</td>\n",
       "      <td>63</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Dacheng Tao</td>\n",
       "      <td>63</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Li Deng</td>\n",
       "      <td>62</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Wanli Ouyang</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24170</th>\n",
       "      <td>Attaullah Buriro</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24171</th>\n",
       "      <td>Bruno Crispo</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24172</th>\n",
       "      <td>Electron Kebebew</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24173</th>\n",
       "      <td>Ken C. L. Wong</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24174</th>\n",
       "      <td>Ronald M. Summers</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>24175 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "             author_name  self_citations\n",
       "0       Loet Leydesdorff              64\n",
       "1              Rui Zhang              63\n",
       "2            Dacheng Tao              63\n",
       "3                Li Deng              62\n",
       "4           Wanli Ouyang              61\n",
       "...                  ...             ...\n",
       "24170   Attaullah Buriro               1\n",
       "24171       Bruno Crispo               1\n",
       "24172   Electron Kebebew               1\n",
       "24173     Ken C. L. Wong               1\n",
       "24174  Ronald M. Summers               1\n",
       "\n",
       "[24175 rows x 2 columns]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "self_citators"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "d05b95ce-5092-4c2a-9ef1-899c74fb859d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "175"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "self_citators.to_sql(\"author_self_citations\", engine, if_exists=\"replace\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "8a9fe9e7-c784-4e68-8c77-1a902b4f93e4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>topic</th>\n",
       "      <th>self_citation_rate</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>0.466766</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>5</td>\n",
       "      <td>0.411464</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>8</td>\n",
       "      <td>0.408777</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>11</td>\n",
       "      <td>0.397692</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>13</td>\n",
       "      <td>0.373600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>7</td>\n",
       "      <td>0.363426</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>10</td>\n",
       "      <td>0.339543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1</td>\n",
       "      <td>0.326918</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>6</td>\n",
       "      <td>0.220541</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>3</td>\n",
       "      <td>0.205749</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>14</td>\n",
       "      <td>0.182346</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>9</td>\n",
       "      <td>0.163748</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>0</td>\n",
       "      <td>0.150839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>12</td>\n",
       "      <td>0.146869</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>4</td>\n",
       "      <td>0.136446</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    topic  self_citation_rate\n",
       "0       2            0.466766\n",
       "1       5            0.411464\n",
       "2       8            0.408777\n",
       "3      11            0.397692\n",
       "4      13            0.373600\n",
       "5       7            0.363426\n",
       "6      10            0.339543\n",
       "7       1            0.326918\n",
       "8       6            0.220541\n",
       "9       3            0.205749\n",
       "10     14            0.182346\n",
       "11      9            0.163748\n",
       "12      0            0.150839\n",
       "13     12            0.146869\n",
       "14      4            0.136446"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "WITH author_topic AS (\n",
    "    SELECT a.name,\n",
    "           p.topic,\n",
    "           RANK() OVER(PARTITION BY a.name ORDER BY COUNT(p.topic) DESC) AS rank\n",
    "    FROM authors AS a\n",
    "    LEFT JOIN papers AS p ON a.paper_id = p.id\n",
    "    GROUP BY a.name, p.topic\n",
    ")\n",
    "SELECT a.topic, SUM(COALESCE(ac.self_citations, 0)) / COUNT(DISTINCT a.name) AS self_citation_rate\n",
    "FROM author_topic AS a\n",
    "LEFT JOIN author_self_citations AS ac ON a.name = ac.author_name\n",
    "WHERE rank = 1\n",
    "GROUP BY a.topic\n",
    "ORDER BY self_citation_rate DESC;\n",
    "\"\"\"\n",
    "\n",
    "df = pd.read_sql(query, engine)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e1bbc5ae-96ca-4898-9be7-abd4dd9524fc",
   "metadata": {},
   "source": [
    "### top topic of each community\n",
    "- we wish to compare community clusters created by the Louvain algorithm with the topic categoreis we found using LDA.\n",
    "- in neo4j, we used the GDS louvain method to compute community clusters based on the citation graph.\n",
    "- in sql, we took the top 20 most populated communities and computed the most frequent topic for each community.\n",
    "- the results show that the top 3 communities align with the top 3 topics."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e03aa5df-5bae-46b5-ae2e-8d6f023c1e03",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>paper_id</th>\n",
       "      <th>communityId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>9cfb6867-d5ba-461a-8372-f6f2389e1bde</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>9d4f4953-a440-4fb8-bdf4-27786b035e28</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>9d54aed2-cb90-4036-bfca-5754508acc92</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>9d5a22d1-722a-4495-9747-db9f42e2bd6c</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>9dbe1d8c-c9f7-4a19-a92a-4fee395c8e3b</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>134283</th>\n",
       "      <td>9b39472c-cf45-46ca-b223-474e54f267c2</td>\n",
       "      <td>134275</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>134284</th>\n",
       "      <td>9baada71-05b4-4cee-a561-9b96944e1a5e</td>\n",
       "      <td>134278</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>134285</th>\n",
       "      <td>9c38a5be-0786-4803-84dc-b9c70e3005a1</td>\n",
       "      <td>134280</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>134286</th>\n",
       "      <td>9c772bd4-e175-44f0-a75a-f334c6b3935a</td>\n",
       "      <td>134286</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>134287</th>\n",
       "      <td>9c83aadf-22ab-49ca-973a-12754732f39c</td>\n",
       "      <td>134287</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>134288 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    paper_id  communityId\n",
       "0       9cfb6867-d5ba-461a-8372-f6f2389e1bde            2\n",
       "1       9d4f4953-a440-4fb8-bdf4-27786b035e28            5\n",
       "2       9d54aed2-cb90-4036-bfca-5754508acc92            6\n",
       "3       9d5a22d1-722a-4495-9747-db9f42e2bd6c            7\n",
       "4       9dbe1d8c-c9f7-4a19-a92a-4fee395c8e3b           10\n",
       "...                                      ...          ...\n",
       "134283  9b39472c-cf45-46ca-b223-474e54f267c2       134275\n",
       "134284  9baada71-05b4-4cee-a561-9b96944e1a5e       134278\n",
       "134285  9c38a5be-0786-4803-84dc-b9c70e3005a1       134280\n",
       "134286  9c772bd4-e175-44f0-a75a-f334c6b3935a       134286\n",
       "134287  9c83aadf-22ab-49ca-973a-12754732f39c       134287\n",
       "\n",
       "[134288 rows x 2 columns]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    query = \"\"\"\n",
    "    CALL gds.louvain.stream('citation_graph')\n",
    "    YIELD nodeId, communityId\n",
    "    RETURN gds.util.asNode(nodeId).id AS paper_id, communityId\n",
    "    ORDER BY communityId;\n",
    "    \"\"\"\n",
    "    result = session.run(query).data()\n",
    "pd.DataFrame(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "f22a6619-af2d-42b4-bb55-3df512c73014",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "288"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "com = pd.DataFrame(result)\n",
    "com.to_sql(\"communities\", engine, if_exists=\"replace\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "fef97664-ca3b-4152-ba03-ef76c4651317",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>communityId</th>\n",
       "      <th>top_topic</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>27353</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>27707</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>38226</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>43552</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>46081</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>48783</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>49004</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>50171</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>60817</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>62637</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>70186</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>71437</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>86826</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>88740</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>89319</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>89973</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>92376</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>92849</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>106956</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>113985</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    communityId  top_topic\n",
       "0         27353          7\n",
       "1         27707         10\n",
       "2         38226          7\n",
       "3         43552         10\n",
       "4         46081         10\n",
       "5         48783          3\n",
       "6         49004          2\n",
       "7         50171          9\n",
       "8         60817          3\n",
       "9         62637         12\n",
       "10        70186          7\n",
       "11        71437          3\n",
       "12        86826          7\n",
       "13        88740          7\n",
       "14        89319          1\n",
       "15        89973         11\n",
       "16        92376          8\n",
       "17        92849         13\n",
       "18       106956          2\n",
       "19       113985         11"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "WITH community_rank AS (\n",
    "    SELECT c.\"communityId\", ARRAY_AGG(c.paper_id) AS papers\n",
    "    FROM communities AS c\n",
    "    GROUP BY c.\"communityId\"\n",
    "    ORDER BY COUNT(*) DESC\n",
    "    LIMIT 20\n",
    "), topic_rank AS (\n",
    "    SELECT cr.\"communityId\",\n",
    "           p.topic,\n",
    "           RANK() OVER(PARTITION BY cr.\"communityId\" ORDER BY COUNT(p.topic) DESC) AS t_rank\n",
    "    FROM (SELECT \"communityId\", UNNEST(papers) AS paper_id FROM community_rank) AS cr\n",
    "    LEFT JOIN papers AS p ON cr.paper_id = p.id\n",
    "    GROUP BY cr.\"communityId\", p.topic\n",
    ")\n",
    "SELECT tr.\"communityId\", tr.topic AS top_topic\n",
    "FROM topic_rank AS tr\n",
    "WHERE t_rank = 1;\n",
    "\"\"\"\n",
    "df = pd.read_sql(query, engine)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "c4b59a73-9911-49ba-b6b6-3d1d74428fac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "top_topic\n",
       "7     5\n",
       "10    3\n",
       "3     3\n",
       "2     2\n",
       "11    2\n",
       "9     1\n",
       "12    1\n",
       "1     1\n",
       "8     1\n",
       "13    1\n",
       "Name: count, dtype: int64"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df['top_topic'].value_counts()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1f5ab82e-e67d-418c-aa61-ad0b8a3a790c",
   "metadata": {},
   "source": [
    "### recommender\n",
    "- the following set of qeries recommends 5 most relevant papers based on an input paper id.\n",
    "- in neo4j: we find similar papers based on a relevance score (defined below).\n",
    "- in sql: we retrieve the title, year, authors, and abstract of the most relevant papers, orderd by their relevance score and breaking ties with the year published. \n",
    "- the output is a set of papers that are most relevant to the input paper and their title and abstract.\n",
    "- *note:* because the network only contains paper nodes with papers published in year 2010 or later. the recommender can only make effective recommendations on papers after the year 2011"
   ]
  },
  {
   "cell_type": "raw",
   "id": "646446e1-99c9-41bb-b8a6-203d3871fa9f",
   "metadata": {},
   "source": [
    "## creating community nodes and edges using louvain\n",
    "\n",
    "with driver.session() as session:\n",
    "    query = \"\"\"\n",
    "    CALL gds.louvain.write(\n",
    "      'citation_graph',  // Use the projected graph\n",
    "      {\n",
    "        writeProperty: 'community'\n",
    "      }\n",
    "    );\n",
    "    \n",
    "    MATCH (p:Paper)\n",
    "    WITH DISTINCT p.community AS communityId\n",
    "    MERGE (c:Community {id: communityId});\n",
    "\n",
    "    MATCH (p:Paper), (c:Community {id: p.community})\n",
    "    MERGE (p)-[:IN_COMMUNITY]->(c);\n",
    "\n",
    "    MATCH (p:Paper)-[:IN_COMMUNITY]->(c:Community)\n",
    "    RETURN p.id, c.id\n",
    "    LIMIT 10;\n",
    "    \"\"\"\n",
    "    result = session.run(query).data()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fc79cf7e-a904-48a8-973a-412ffb0ea3c2",
   "metadata": {},
   "source": [
    "### example input paper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "1d9a7cfd-9a75-4889-a678-700e3fd4b270",
   "metadata": {},
   "outputs": [],
   "source": [
    "input_paper_id = \"705da740-2fe7-4712-99bc-128ca0fa24aa\"\n",
    "def view_papers(p):\n",
    "    print(f\"{p['title']} ({p['year']}) \\n\")\n",
    "    print('authors: ',', '.join(p['author_names']), '\\n')\n",
    "    print(p['abstract'], '\\n\\n\\n')\n",
    "    return"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "996a4518-149e-46bf-a583-12d020072c9a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Auto-Context and Its Application to High-Level Vision Tasks and 3D Brain Image Segmentation (2010) \n",
      "\n",
      "authors:  Zhuowen Tu, Xiang Bai \n",
      "\n",
      "The notion of using context information for solving high-level vision and medical image segmentation problems has been increasingly realized in the field. However, how to learn an effective and efficient context model, together with an image appearance model, remains mostly unknown. The current literature using Markov Random Fields (MRFs) and Conditional Random Fields (CRFs) often involves specific algorithm design in which the modeling and computing stages are studied in isolation. In this paper, we propose a learning algorithm, auto-context. Given a set of training images and their corresponding label maps, we first learn a classifier on local image patches. The discriminative probability (or classification confidence) maps created by the learned classifier are then used as context information, in addition to the original image patches, to train a new classifier. The algorithm then iterates until convergence. Auto-context integrates low-level and context information by fusing a large number of low-level appearance features with context and implicit shape information. The resulting discriminative algorithm is general and easy to implement. Under nearly the same parameter settings in training, we apply the algorithm to three challenging vision applications: foreground/background segregation, human body configuration estimation, and scene region labeling. Moreover, context also plays a very important role in medical/brain images where the anatomical structures are mostly constrained to relatively fixed positions. With only some slight changes resulting from using 3D instead of 2D features, the auto-context algorithm applied to brain MRI image segmentation is shown to outperform state-of-the-art algorithms specifically designed for this domain. Furthermore, the scope of the proposed algorithm goes beyond image analysis and it has the potential to be used for a wide variety of problems for structured prediction problems. \n",
      "\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "SELECT p.title, p.year, au.names AS author_names, a.abstract\n",
    "FROM papers AS p\n",
    "LEFT JOIN (SELECT paper_id, ARRAY_AGG(name) AS names\n",
    "           FROM authors\n",
    "           GROUP BY paper_id) AS au ON p.id = au.paper_id\n",
    "JOIN (SELECT paper_id, abstract FROM abstracts WHERE paper_id = '{input_paper_id}') AS a\n",
    "    ON p.id = a.paper_id\n",
    "\"\"\"\n",
    "input_paper = pd.read_sql(query, engine)\n",
    "input_paper.apply(view_papers, axis=1);"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e945f276-e068-40b8-b67e-12518dacec38",
   "metadata": {},
   "source": [
    "### calculate a paper's relevance score as:\n",
    "\n",
    "$\\text{relevance} = 2 * \\mathbf{1}[\\text{same community}] + \\text{number of shared authors} + \\mathbf{1}[\\text{cited by input paper}]$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "e6e7ca53-2f8d-4705-bc14-0b02da14fe0e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'paperId': '3221a8c8-12a1-4777-853e-e1c112d8c099', 'totalRelevance': 18},\n",
       " {'paperId': 'dd1a01d2-8b4a-4eb4-aa60-5d8a99333d0f', 'totalRelevance': 15},\n",
       " {'paperId': 'a5550047-b1ee-492a-a5ff-4b760f5c1ec3', 'totalRelevance': 15},\n",
       " {'paperId': '80a73983-3e49-453b-a834-c5d01adbecb6', 'totalRelevance': 14},\n",
       " {'paperId': '66344222-224c-4605-a828-ff364d72a701', 'totalRelevance': 14}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    query = \"\"\"\n",
    "    // find input paper\n",
    "    MATCH (p:Paper {id: $paperId})\n",
    "    \n",
    "    // 2x weight for community\n",
    "    MATCH (p)-[:IN_COMMUNITY]->(c:Community)<-[:IN_COMMUNITY]-(p2)\n",
    "    WITH p2, count(p2) * 2 AS communityScore  \n",
    "    \n",
    "    // count shared authors\n",
    "    OPTIONAL MATCH (p)<-[:AUTHORED]-(a:Author)-[:AUTHORED]->(p2:Paper)\n",
    "    WITH p, p2, communityScore, count(a) AS authorScore  \n",
    "\n",
    "    // count cited papers\n",
    "    OPTIONAL MATCH (p)-[:CITED]->(p2)\n",
    "    WITH p, p2, communityScore, authorScore, count(p2) AS citationScore  \n",
    "\n",
    "    // cited same papers\n",
    "    OPTIONAL MATCH (p)-[:CITED]->(p3:Paper)<-[:CITED]-(p2)\n",
    "    WITH p, p2, communityScore, authorScore, citationScore, count(p3) AS commonCiteScore\n",
    "    \n",
    "    RETURN \n",
    "        p2.id AS paperId, \n",
    "        authorScore + citationScore + communityScore + commonCiteScore AS totalRelevance\n",
    "    ORDER BY totalRelevance DESC\n",
    "    LIMIT 5;\n",
    "    \"\"\"\n",
    "    result = session.run(query, paperId=input_paper_id).data()\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "87ff5404-f1d9-4013-a02e-2530b7d901f5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "relevant = pd.DataFrame(result)\n",
    "relevant.to_sql(\"relevant\", engine, if_exists=\"replace\", index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0426dfb8-2a96-445e-9dc6-9d8076615b53",
   "metadata": {},
   "source": [
    "### top 5 recommendations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "4bd19cee-6898-4e89-995d-a2f1ad945835",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hyperspectral Unmixing with Robust Collaborative Sparse Regression (2016) \n",
      "\n",
      "authors:  Chang Li, Xiaoguang Mei, Yong Ma \n",
      "\n",
      "Recently, sparse unmixing (SU) of hyperspectral data has received particular attention for analyzing remote sensing images. However, most SU methods are based on the commonly admitted linear mixing model (LMM), which ignores the possible nonlinear effects (i.e., nonlinearity). In this paper, we propose a new method named robust collaborative sparse regression (RCSR) based on the robust LMM (rLMM) for hyperspectral unmixing. The rLMM takes the nonlinearity into consideration, and the nonlinearity is merely treated as outlier, which has the underlying sparse property. The RCSR simultaneously takes the collaborative sparse property of the abundance and sparsely distributed additive property of the outlier into consideration, which can be formed as a robust joint sparse regression problem. The inexact augmented Lagrangian method (IALM) is used to optimize the proposed RCSR. The qualitative and quantitative experiments on synthetic datasets and real hyperspectral images demonstrate that the proposed RCSR is efficient for solving the hyperspectral SU problem compared with the other four state-of-the-art algorithms. \n",
      "\n",
      "\n",
      "\n",
      "Robust Sparse Hyperspectral Unmixing With $ell_{2,1}$ Norm (2017) \n",
      "\n",
      "authors:  Chang Li, Xiaoguang Mei, Yong Ma \n",
      "\n",
      "Sparse unmixing (SU) of hyperspectral data have recently received particular attention for analyzing remote sensing images, which aims at finding the optimal subset of signatures to best model the mixed pixel in the scene. However, most SU methods are based on the commonly admitted linear mixing model, which ignores the possible nonlinear effects (i.e., nonlinearity), and the nonlinearity is merely treated as outlier. Besides, the traditional SU algorithms often adopt the    $\\ell _{2}$    norm loss function, which makes them sensitive to noises and outliers. In this paper, we propose a robust SU (RSU) method with    $\\ell _{2,1}$    norm loss function, which is robust for noises and outliers. Then, the RSU can be solved by the alternative direction method of multipliers. Finally, the experiments on both synthetic data sets and real hyperspectral images demonstrate that the proposed RSU is efficient for solving the hyperspectral SU problem compared with the state-of-the-art algorithms. \n",
      "\n",
      "\n",
      "\n",
      "Alzheimer's disease diagnostics by adaptation of 3D convolutional network (2016) \n",
      "\n",
      "authors:  Ayman El-Baz, Ehsan Hosseini-Asl, Robert S. Keynton \n",
      "\n",
      "Early diagnosis, playing an important role in preventing progress and treating the Alzheimer's disease (AD), is based on classification of features extracted from brain images. The features have to accurately capture main AD-related variations of anatomical brain structures, such as, e.g., ventricles size, hippocampus shape, cortical thickness, and brain volume. This paper proposed to predict the AD with a deep 3D convolutional neural network (3D-CNN), which can learn generic features capturing AD biomarkers and adapt to different domain datasets. The 3D-CNN is built upon a 3D convolutional autoencoder, which is pre-trained to capture anatomical shape variations in structural brain MRI scans. Fully connected upper layers of the 3D-CNN are then fine-tuned for each task-specific AD classification. Experiments on the CADDementia MRI dataset with no skull-stripping preprocessing have shown our 3D-CNN outperforms several conventional classifiers by accuracy. Abilities of the 3D-CNN to generalize the features learnt and adapt to other domains have been validated on the ADNI dataset. \n",
      "\n",
      "\n",
      "\n",
      "Alzheimer's Disease Diagnostics by a Deeply Supervised Adaptable 3D Convolutional Network (2016) \n",
      "\n",
      "authors:  Ayman El-Baz, Ehsan Hosseini-Asl, Georgy L. Gimelfarb \n",
      "\n",
      "Early diagnosis, playing an important role in preventing progress and treating the Alzheimer's disease (AD), is based on classification of features extracted from brain images. The features have to accurately capture main AD-related variations of anatomical brain structures, such as, e.g., ventricles size, hippocampus shape, cortical thickness, and brain volume. This paper proposes to predict the AD with a deep 3D convolutional neural network (3D-CNN), which can learn generic features capturing AD biomarkers and adapt to different domain datasets. The 3D-CNN is built upon a 3D convolutional autoencoder, which is pre-trained to capture anatomical shape variations in structural brain MRI scans. Fully connected upper layers of the 3D-CNN are then fine-tuned for each task-specific AD classification. Experiments on the \\emph{ADNI} MRI dataset with no skull-stripping preprocessing have shown our 3D-CNN outperforms several conventional classifiers by accuracy and robustness. Abilities of the 3D-CNN to generalize the features learnt and adapt to other domains have been validated on the \\emph{CADDementia} dataset. \n",
      "\n",
      "\n",
      "\n",
      "Exploiting Domain Knowledge in Aspect Extraction (2013) \n",
      "\n",
      "authors:  Arjun Mukherjee, Bing Liu, Zhiyuan Chen \n",
      "\n",
      "Aspect extraction is one of the key tasks in sentiment analysis. In recent years, statistical models have been used for the task. However, such models without any domain knowledge often produce aspects that are not interpretable in applications. To tackle the issue, some knowledge-based topic models have been proposed, which allow the user to input some prior domain knowledge to generate coherent aspects. However, existing knowledge-based topic models have several major shortcomings, e.g., little work has been done to incorporate the cannot-link type of knowledge or to automatically adjust the number of topics based on domain knowledge. This paper proposes a more advanced topic model, called MC-LDA (LDA with m-set and c-set), to address these problems, which is based on an Extended generalized Polya urn (E-GPU) model (which is also proposed in this paper). Experiments on real-life product reviews from a variety of domains show that MCLDA outperforms the existing state-of-the-art models markedly. \n",
      "\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "SELECT rp.\"paperId\", p.title, p.year, au.names AS author_names, a.abstract\n",
    "FROM relevant AS rp\n",
    "LEFT JOIN papers AS p ON rp.\"paperId\" = p.id\n",
    "LEFT JOIN abstracts a on p.id = a.paper_id\n",
    "LEFT JOIN (SELECT paper_id, ARRAY_AGG(name) AS names\n",
    "           FROM authors\n",
    "           GROUP BY paper_id) AS au ON p.id = au.paper_id\n",
    "ORDER BY rp.\"totalRelevance\",\n",
    "    ABS(p.year - (SELECT p1.year\n",
    "                       FROM papers AS p1\n",
    "                       WHERE p1.id = '{input_paper_id}'));\n",
    "\"\"\"\n",
    "rec_papers = pd.read_sql(query, engine)\n",
    "\n",
    "rec_papers.apply(view_papers, axis=1);"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "11d6615f-e9da-4f09-8655-8956ad4abd32",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6eb20c7c-c972-4090-b2bf-5bfcaae62ecf",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
